{
  "backend/main.mo": "Main backend actor implementing user registration/login with approval workflow, blog post management, and admin access control using AccessControl and UserApproval modules with Map-based data stores for users and posts.",
  "feature_evidence.json": "Feature evidence report documenting four features related to fixing admin panel connectivity issues, getAllUsers query handling, AdminPanelPage updates, and complete workflow testing with associated test IDs and high confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files including App.tsx, layout components, pages, hooks, and configuration files describing their roles in the H★S Online Earn Platform application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including sidebar, chart, and UI component color variables.",
  "frontend/index.html": "Main HTML entry point with SEO meta tags for H★S Online Earn Platform, robots indexing directive, and root div mounting point for React application.",
  "frontend/public/registration.html": "Static HTML file for registration route with identical structure to index.html including SEO meta tags and React mounting point.",
  "frontend/public/registration/index.html": "Nested registration route HTML file with same SEO configuration and React mounting structure as other entry points.",
  "frontend/public/robots.txt": "Robots.txt file allowing all search engines to index the entire site and specifying sitemap location at /sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing all site URLs including home, registration, blog, tasks, and individual blog posts with priority and change frequency metadata for SEO.",
  "frontend/scripts/README-sitemap.md": "Documentation explaining when and how to update the sitemap.xml file when adding, removing, or modifying blog posts.",
  "frontend/src/App.tsx": "Main React application file defining AuthContext/Provider for session management, RegistrationForm and LoginForm components, and router configuration with all page routes wrapped in SiteLayout.",
  "frontend/src/components/admin/UserListTable.tsx": "Displays a table of user approval requests with status badges (pending, approved, rejected) and allows admins to approve pending users via mutation hook with toast notifications.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Renders a clickable card for a blog post showing title, published date, excerpt, and a 'Read more' link to the post detail page.",
  "frontend/src/components/home/DailyTaskSection.tsx": "Provides a daily task interface that opens random external links for users to find secret codes, with a form to submit codes and success feedback.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with responsive background images, Bengali welcome text introducing Md. Habibur Rahman's online earning platform, and a CTA button linking to registration.",
  "frontend/src/components/home/TimeBucksMegaEarningTaskCard.tsx": "Promotional card for TimeBucks referral link highlighting earning opportunities ($2-$5/day) with a $1 signup bonus and external link button.",
  "frontend/src/components/home/TimeBucksStepByStepGuideSection.tsx": "Step-by-step guide section explaining how to sign up, verify, and earn money on TimeBucks with numbered steps and special notes.",
  "frontend/src/components/home/TranscribeMeSectionCard.tsx": "Promotional card for TranscribeMe transcription jobs with step-by-step registration guide, payment info, and external link to job application page.",
  "frontend/src/components/home/WelcomeSection.tsx": "Welcome section with Bengali text introducing Md. Habibur Rahman and describing the website's purpose to provide free income site tutorials.",
  "frontend/src/components/layout/MobileMenu.tsx": "A mobile navigation menu component that slides in from the right with a backdrop, featuring navigation links, task submenu items, and body scroll locking when open.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component displaying copyright information, owner details (Md. Habibur Rahman), WhatsApp contact link, quick navigation links, and Caffeine.ai attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header component with logo, desktop navigation menu with dropdown for work tasks, mobile menu toggle, and a \"Get Started\" CTA button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout wrapper component that renders a fixed background with overlay, site header, main content outlet, and footer in a flex column structure.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "A placeholder component for advertisement spaces with configurable variants (banner, sidebar, in-content) displaying a dashed border box with icon and label.",
  "frontend/src/components/monetization/AdsterraNativeBanner.tsx": "Component that dynamically loads and renders an Adsterra native banner ad script with cleanup on unmount to prevent duplicate script loading.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "A placeholder card component for affiliate product recommendations with customizable title, description, and a \"Learn More\" button.",
  "frontend/src/components/registration/LoginForm.tsx": "Empty file placeholder for login form component.",
  "frontend/src/components/registration/RegistrationForm.tsx": "Empty file placeholder for registration form component.",
  "frontend/src/components/seo/Seo.tsx": "SEO component that dynamically updates document title, meta tags (description, Open Graph, Twitter Card), and canonical URL based on provided props.",
  "frontend/src/components/tasks/ApprovalGuard.tsx": "Route guard component that redirects unauthenticated users to registration and displays blocking messages for pending or rejected user accounts, only allowing approved users to access child content.",
  "frontend/src/components/tasks/TaskHowToCompleteSection.tsx": "Informational component displaying a numbered 4-step guide on how to complete a task, including starting work, finding the secret code, pasting it, and submitting.",
  "frontend/src/components/tasks/TaskInteractionCard.tsx": "React component that displays a card with a button to open a task URL in a new tab and a form to submit a secret code with success feedback.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, handling authentication with Internet Identity and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAuthContext.tsx": "Empty file with no content.",
  "frontend/src/hooks/useBlogPosts.ts": "Custom React hooks for fetching blog posts (all posts, single post by slug, and search) from the backend actor, with fallback to sample posts when backend is unavailable.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state and identity persistence using the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user management operations (register, login, get all users, approvals) and admin operations, with comprehensive error handling and query invalidation.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives, custom CSS variables for theming (including neon colors and dark mode), and styles for fixed background images with responsive mobile support.",
  "frontend/src/lib/blogSampleFallback.ts": "Exports sample blog post data used as fallback content when the backend is unavailable, including posts about passive income and digital marketing.",
  "frontend/src/lib/helpLinks.ts": "Exports an array of help links with labels and Facebook profile URLs for two admins.",
  "frontend/src/lib/registrationConfig.ts": "Configuration object containing the Google Form embed URL for the registration page.",
  "frontend/src/lib/siteConfig.ts": "Site-wide configuration object for SEO metadata including site name, description, URL, and default image for the H★S Online Earn Platform.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying biography, expertise areas, contact information, and social media links with SEO metadata and ad placeholders.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with Internet Identity authentication, admin role verification, and user management interface with loading and access control states.",
  "frontend/src/pages/BlogListPage.tsx": "Blog listing page that fetches and displays all blog posts in a grid layout with loading states, error handling, and ad placements.",
  "frontend/src/pages/BlogPostPage.tsx": "Individual blog post page that displays full post content with formatted date, SEO metadata, and integrated ad/affiliate link placeholders.",
  "frontend/src/pages/HomePage.tsx": "Home page component that renders HeroSection and WelcomeSection with SEO metadata.",
  "frontend/src/pages/PaymentProofPage.tsx": "Payment proof gallery page displaying success screenshots in a grid with Bengali text and external link to upload new proofs via Google Forms.",
  "frontend/src/pages/RegistrationPage.tsx": "Registration/login page with tabbed interface, authentication state handling, redirect logic for authenticated users, and Bengali hero section with background image.",
  "frontend/src/pages/SupportPage.tsx": "Support/contact page displaying two administrator cards (Habibur Rahman and Sumaiya) with Facebook profile links and contact buttons, wrapped in a glass-styled layout with SEO metadata.",
  "frontend/src/pages/Task1Page.tsx": "Task 1 page component that renders task instructions, an interaction card with a shrinkme.click URL, and a back-to-home button, all wrapped in ApprovalGuard and SEO components.",
  "frontend/src/pages/Task2Page.tsx": "Task 2 page component identical in structure to Task1Page but with a different shrinkme.click URL for task completion.",
  "frontend/src/pages/Task3Page.tsx": "Task 3 page component identical in structure to Task1Page and Task2Page but with its own unique shrinkme.click URL.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract, persist, and manage URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including neon and rainbow palettes using OKLCH), container settings, border radius variables, and custom box-shadow utilities for the application theme.",
  "project_state.json": "Project state metadata tracking architectural decisions, known issues, existing features, and current consolidation work to move all authentication logic into App.tsx to resolve AuthProvider context errors."
}