{
  "backend/main.mo": "Motoko actor managing blog posts with create, fetch, list, and search functions stored in a Map.",
  "feature_evidence.json": "Feature evidence file describing a new Welcome section with Bengali text and listing related files and metadata.",
  "frontend-file-summaries.txt": "Text file containing summarized descriptions of various frontend components and pages.",
  "frontend/index.css": "Tailwind base styles defining CSS variables for light and dark themes plus global background and text rules.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/public/robots.txt": "Robots.txt allowing full crawling and specifying sitemap location.",
  "frontend/public/sitemap.xml": "Sitemap listing URLs for home, blog, about, and five blog posts with priorities and change frequencies.",
  "frontend/scripts/README-sitemap.md": "Documentation explaining how and when to update the sitemap file.",
  "frontend/src/App.tsx": "Main React router setup defining routes for home, blog list, blog post, and about pages using SiteLayout.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Card component showing a blog post’s title, date, excerpt, and link to its detail page.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with background image, large heading, description, and links to blog and about pages.",
  "frontend/src/components/home/WelcomeSection.tsx": "Welcome section displaying a styled block of Bengali introductory text.",
  "frontend/src/components/layout/MobileMenu.tsx": "Mobile slide‑in menu with scroll lock, close button, navigation links, and help links.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component with about info, navigation links, help links, and social icons.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with logo, desktop navigation, and a mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including background, header, routed content, and footer.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "Styled placeholder component representing different ad slot variants.",
  "frontend/src/components/monetization/AdsterraNativeBanner.tsx": "Loads an Adsterra script once and renders its banner container.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "Card-style placeholder for affiliate product recommendations.",
  "frontend/src/components/seo/Seo.tsx": "Updates document title, meta tags, and canonical URL for SEO and social sharing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useBlogPosts.ts": "React-query hooks for fetching posts, single posts, and searching posts with fallback data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/index.css": "Configures Tailwind layers, CSS variables for themes, and global background/overlay styling including responsive parallax images.",
  "frontend/src/lib/blogSampleFallback.ts": "Provides fallback sample blog posts to display when the backend has no data or is unreachable.",
  "frontend/src/lib/helpLinks.ts": "Exports a list of admin help links with labels and URLs.",
  "frontend/src/lib/siteConfig.ts": "Defines global site metadata including name, description, URL, and default image.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with biography, expertise sections, contact details, and SEO metadata.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a list of blog posts with loading and error states plus ads and SEO metadata.",
  "frontend/src/pages/BlogPostPage.tsx": "Renders an individual blog post with SEO tags, content, ads, affiliate sections, and navigation.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero sections, feature highlights, ads, and SEO metadata.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color system via CSS variables, extended themes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state description detailing site features, design goals, issues, and architectural notes for a responsive neon‑styled website with ads and Bengali welcome section."
}