{
  "backend/main.mo": "Motoko actor managing blog posts with create, fetch, list, and search functions using an in-memory map.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color variables, dark mode values, and global styling.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and referencing the sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing home, blog, about, and all five new blog post URLs.",
  "frontend/scripts/README-sitemap.md": "Instructions for updating sitemap.xml when blog posts change.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, blog list, blog posts, and about pages.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Blog post preview card showing title, date, excerpt, and link to the post.",
  "frontend/src/components/home/HeroSection.tsx": "Home page hero section with banner image, headline, and CTA buttons.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with about text, navigation links, social icons, and © MHS Habibur Blog notice.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with logo, navigation links, and active route highlighting.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, main content outlet, and footer.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "Renders a styled placeholder box for different ad variants with an icon and labels.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "Displays a placeholder affiliate card with title, description, and a CTA button.",
  "frontend/src/components/seo/Seo.tsx": "Sets document title and meta tags for SEO, Open Graph, Twitter cards, and canonical URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useBlogPosts.ts": "Provides React Query hooks to fetch, fetch by slug, and search blog posts with fallback data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, state, and provider context using the Dfinity AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles, warm color variables, typography, and blog prose formatting.",
  "frontend/src/lib/blogSampleFallback.ts": "Provides sample blog posts used when backend data is unavailable.",
  "frontend/src/lib/siteConfig.ts": "Exports global site metadata including name, description, URL, and default image.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with biography, expertise, contact info, and social links, including ad placeholders and SEO metadata.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a list of blog posts with loading and error states, plus SEO metadata and an ad banner.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a single blog post with date, content, ads, affiliate section, error handling, and SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Implements the home landing page with hero section, feature cards, latest blog CTA, and an ad banner.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, plugins, animations, and content paths.",
  "project_state.json": "Tracks project metadata, features, and state for a responsive SEO-friendly blog site."
}