{
  "backend/main.mo": "Motoko canister managing blog posts with create, fetch, list, search, and slug lookup functionality.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptions summarizing each component or page’s purpose.",
  "frontend/index.css": "Tailwind base styles defining CSS variables for light/dark themes and applying global background/text settings.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/robots.txt": "Robots.txt allowing full crawling and referencing sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing URLs for home, blog, about, task pages, and sample blog posts with metadata.",
  "frontend/scripts/README-sitemap.md": "Instructions for updating sitemap.xml when blog posts change.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, blog list, blog post details, about, and task pages.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Blog post preview card showing title, formatted date, excerpt, and link to full post.",
  "frontend/src/components/home/DailyTaskSection.tsx": "Daily task module opening random links and accepting a secret code submission with success feedback.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with background image, multilingual text, and CTA button linking to Facebook profile.",
  "frontend/src/components/home/TimeBucksMegaEarningTaskCard.tsx": "Displays a promotional card for TimeBucks with earning details, bonus info, and a signup button linking to an external referral URL.",
  "frontend/src/components/home/TimeBucksStepByStepGuideSection.tsx": "Renders a step-by-step guide explaining how to sign up, verify, work, and withdraw earnings on TimeBucks.",
  "frontend/src/components/home/TranscribeMeSectionCard.tsx": "Shows an overview of TranscribeMe transcription jobs with steps, tips, and a CTA linking to the job application page.",
  "frontend/src/components/home/WelcomeSection.tsx": "Displays a welcome message from the site owner introducing upcoming income site tutorials.",
  "frontend/src/components/layout/MobileMenu.tsx": "Implements a mobile slide-in navigation menu with scroll locking, links, and close controls.",
  "frontend/src/components/layout/SiteFooter.tsx": "Provides footer sections including about info, quick links, help links, social icons, and copyright text.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the site header with logo, navigation links, a tasks dropdown, and a mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main layout with background layers, header, routed content area, and footer.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "Renders a styled placeholder box for different ad slot variants such as banner, sidebar, and in-content.",
  "frontend/src/components/monetization/AdsterraNativeBanner.tsx": "Loads an Adsterra script once and renders a container div for the native banner.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "Displays a styled placeholder card for an affiliate product with title, description, and button.",
  "frontend/src/components/seo/Seo.tsx": "Dynamically updates document title and SEO meta tags including Open Graph and Twitter Card values.",
  "frontend/src/components/tasks/TaskHowToCompleteSection.tsx": "Shows a four‑step instructional list explaining how to complete a task.",
  "frontend/src/components/tasks/TaskInteractionCard.tsx": "Provides UI for starting a task, entering a secret code, and showing a temporary success message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useBlogPosts.ts": "Supplies hooks for fetching, retrieving, and searching blog posts with fallback sample data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, identity persistence, and auth status handling.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables, and global styles including neon color themes and background images.",
  "frontend/src/lib/blogSampleFallback.ts": "Provides fallback sample blog posts when the backend has no data or is unavailable.",
  "frontend/src/lib/helpLinks.ts": "Defines a list of static admin help links with labels and URLs.",
  "frontend/src/lib/siteConfig.ts": "Contains site-wide SEO and metadata configuration such as name, description, and default image.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with biography, expertise sections, and contact info using SEO and layout components.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a list of blog posts with loading and error states and includes SEO and ad placeholders.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a single blog post with metadata, content, ads, and fallbacks for loading and errors.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero and welcome sections and sets SEO metadata.",
  "frontend/src/pages/Task1Page.tsx": "Presents Task 1 instructions and interaction card with a link back to home.",
  "frontend/src/pages/Task2Page.tsx": "Presents Task 2 instructions and interaction card with a link back to home.",
  "frontend/src/pages/Task3Page.tsx": "Presents Task 3 instructions and interaction card with a link back to home.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom themes, colors, typography, animations, and container settings.",
  "project_state.json": "Defines the project’s current state with homepage design updates, navigation/mobile requirements, and visual/contrast rules, plus notes on known issues and existing features. Provides detailed architectural guidance for layout, styling, and ad embedding behavior."
}