{
  "backend/main.mo": "Motoko actor storing blog posts in a map with create, fetch, list, and search functions sorted by publish time.",
  "feature_evidence.json": "Feature evidence report listing planned features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend source files.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "HTML entry file loading the root React app through main.tsx.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and referencing the sitemap.",
  "frontend/public/sitemap.xml": "XML sitemap listing URLs for home, blog, about, tasks, and sample blog posts.",
  "frontend/scripts/README-sitemap.md": "Instructions for updating sitemap.xml when blog posts change.",
  "frontend/src/App.tsx": "Defines TanStack Router routes for home, blog pages, about page, and three task pages.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Card component showing blog title, date, excerpt, and link to post detail.",
  "frontend/src/components/home/DailyTaskSection.tsx": "Interactive section with random task links and a secret code submission form.",
  "frontend/src/components/home/HeroSection.tsx": "Hero banner with intro message and CTA buttons linking to blog and about pages.",
  "frontend/src/components/home/TimeBucksMegaEarningTaskCard.tsx": "Displays a promotional card for TimeBucks with earning details, signup bonus, and a CTA button linking externally.",
  "frontend/src/components/home/TimeBucksStepByStepGuideSection.tsx": "Shows a step-by-step guide for using TimeBucks with numbered steps and a special note.",
  "frontend/src/components/home/TranscribeMeSectionCard.tsx": "Presents an overview of TranscribeMe transcription work with steps, tips, and a CTA link.",
  "frontend/src/components/home/WelcomeSection.tsx": "Renders a welcome message introducing the site owner and upcoming features.",
  "frontend/src/components/layout/MobileMenu.tsx": "Implements a slide-in mobile navigation menu with links, scroll lock, and escape-to-close support.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays footer content including about text, quick links, help links, and social icons.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides the site header with logo, navigation, task dropdown, and mobile menu trigger.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the overall site layout with background, header, main outlet, and footer.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "Renders a styled placeholder box representing different ad slot variants.",
  "frontend/src/components/monetization/AdsterraNativeBanner.tsx": "Loads an Adsterra script once and renders a container for the native banner.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "Displays a styled placeholder card for affiliate product promotions.",
  "frontend/src/components/seo/Seo.tsx": "Updates document title, meta tags, and canonical link for SEO and social sharing.",
  "frontend/src/components/tasks/TaskInteractionCard.tsx": "Provides a UI for opening a task link and submitting a secret code with success feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useBlogPosts.ts": "Fetches posts, single posts, and search results using the actor with fallbacks to sample data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and context provisioning.",
  "frontend/src/index.css": "Defines Tailwind base layers and site-wide color variables, backgrounds, and global styles.",
  "frontend/src/lib/blogSampleFallback.ts": "Provides sample blog posts used when backend post retrieval fails or returns empty.",
  "frontend/src/lib/helpLinks.ts": "Exports a list of admin help contact links.",
  "frontend/src/lib/siteConfig.ts": "Defines global site metadata including name, description, URL, and default image.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with SEO metadata, biography details, expertise sections, and contact info with ad placement.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a blog list with SEO, loading and error states, ad placement, and a grid of BlogPostCard components.",
  "frontend/src/pages/BlogPostPage.tsx": "Fetches and renders a full blog post with metadata, ads, affiliate link placeholder, and navigation back to the blog.",
  "frontend/src/pages/HomePage.tsx": "Shows the home page with a welcome section, SEO metadata, and a call‑to‑action button linking to Task 1.",
  "frontend/src/pages/Task1Page.tsx": "Presents Task 1 with SEO metadata and a TaskInteractionCard pointing to an external task URL.",
  "frontend/src/pages/Task2Page.tsx": "Presents Task 2 with SEO metadata and a TaskInteractionCard linked to its task URL.",
  "frontend/src/pages/Task3Page.tsx": "Presents Task 3 with SEO metadata and a TaskInteractionCard linked to its task URL.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, container settings, animations, and extended styling tokens.",
  "project_state.json": "Stores project state, architectural notes, known issues, and feature metadata for the site’s design and functionality."
}