{
  "backend/main.mo": "Motoko canister managing blog posts with create, fetch, list, search, and slug retrieval functions.",
  "feature_evidence.json": "Feature report describing an update to the hero section text and styling in HeroSection.tsx.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing layout, components, pages, hooks, config, and styling.",
  "frontend/index.css": "Tailwind base/theme variables using OKLCH color values with light/dark mode tokens and global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and declaring sitemap location.",
  "frontend/public/sitemap.xml": "Sitemap listing site URLs including home, blog, about, and five sample blog posts.",
  "frontend/scripts/README-sitemap.md": "Instructions for updating sitemap.xml when blog posts change.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for home, blog list, blog post, and about pages wrapped in SiteLayout.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Card component displaying a blog post’s title, date, excerpt, and link to its detail page.",
  "frontend/src/components/home/DailyTaskSection.tsx": "Daily task UI with random task link generator and secret code submission with success message.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with welcome message from Md. Habibur Rahman and CTA buttons.",
  "frontend/src/components/home/TimeBucksMegaEarningTaskCard.tsx": "Promotional card for TimeBucks with benefits, bonus highlight, and external signup link.",
  "frontend/src/components/home/TimeBucksStepByStepGuideSection.tsx": "Renders a styled step-by-step guide in Bangla explaining how to earn from TimeBucks, including steps, notes, and icons.",
  "frontend/src/components/home/TranscribeMeSectionCard.tsx": "Displays a detailed TranscribeMe job info card with steps, tips, and a call-to-action button.",
  "frontend/src/components/home/WelcomeSection.tsx": "Shows a welcome message introducing the site owner and upcoming earning resources.",
  "frontend/src/components/layout/MobileMenu.tsx": "Implements a mobile side menu with scroll locking, escape handling, navigation links, and help resources.",
  "frontend/src/components/layout/SiteFooter.tsx": "Provides a multi-column footer with site info, quick links, help links, social icons, and copyright text.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the header with logo, navigation, active state logic, and mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the site layout structure with background layers, header, routed content, and footer.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "A placeholder component showing mock ad space in various sizes for layout planning.",
  "frontend/src/components/monetization/AdsterraNativeBanner.tsx": "Loads an Adsterra script once and renders a container for the native ad banner.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "Displays a mock affiliate product card with placeholder title, description, and button.",
  "frontend/src/components/seo/Seo.tsx": "React component that sets page title, meta tags, and canonical link for SEO using site configuration.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when the actor changes.",
  "frontend/src/hooks/useBlogPosts.ts": "React Query hooks to fetch, search, and fallback to sample blog posts when backend or identity is unavailable.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables, dark mode themes, and responsive background styling.",
  "frontend/src/lib/blogSampleFallback.ts": "Contains sample blog post data used when the backend is empty or unreachable.",
  "frontend/src/lib/helpLinks.ts": "Exports a small list of admin help links with labels and URLs.",
  "frontend/src/lib/siteConfig.ts": "Defines global site configuration for name, description, URL, and default SEO image.",
  "frontend/src/main.tsx": "Application entry point setting up React, Internet Identity provider, React Query, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO setup, biography content, expertise sections, and contact details.",
  "frontend/src/pages/BlogListPage.tsx": "Renders the blog list with SEO metadata, loading/error states, ad banner, and a grid of BlogPostCard components.",
  "frontend/src/pages/BlogPostPage.tsx": "Fetches and displays a single blog post with SEO metadata, date formatting, ads, affiliate section, and error handling.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage using multiple content sections, featured task components, ads, and SEO setup.",
  "frontend/tailwind.config.js": "Defines Tailwind configuration including theme extensions, color variables, typography, animations, and container settings.",
  "project_state.json": "Stores the project’s state, feature notes, styling requirements, issues, and architectural guidelines."
}