{
  "backend/main.mo": "Main Motoko backend actor implementing user registration/login with username/password authentication, user approval workflow (Pending/Approved/Rejected statuses), blog post management, and admin-only access control for user management endpoints.",
  "feature_evidence.json": "Feature evidence report documenting completed features including removal of Internet Identity authentication from AdminPanelPage, implementation of username/password login form, admin authentication with hardcoded credentials (admin/habibur123), and updates to getAllUsers query hook.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components (layout, blog, SEO), pages (home, blog, about, tasks), hooks (blog posts, queries), configuration (site config, SEO defaults), and styling (OKLCH colors, neon animations, Bengali text support).",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including sidebar, chart, and component color variables.",
  "frontend/index.html": "Main HTML entry point with SEO meta tags (title, description, robots index/follow) and root div for React application mounting.",
  "frontend/public/registration.html": "Static HTML file for registration route with identical SEO meta tags and React mounting structure as main index.html.",
  "frontend/public/registration/index.html": "Nested static HTML file for /registration/ path with same SEO configuration and React mounting point.",
  "frontend/public/robots.txt": "Search engine robots file allowing all crawlers to index the entire site and specifying sitemap location.",
  "frontend/public/sitemap.xml": "XML sitemap listing all site URLs (home, registration, blog, about, payment proof, support, tasks, and individual blog posts) with priority and change frequency metadata for search engines.",
  "frontend/scripts/README-sitemap.md": "Documentation explaining when and how to manually update the sitemap.xml file when adding, removing, or changing blog post URLs.",
  "frontend/src/App.tsx": "Main React application file defining AuthContext/AuthProvider for session management, RegistrationForm and LoginForm components with validation and backend integration, and TanStack Router configuration for all application routes wrapped in SiteLayout.",
  "frontend/src/components/admin/UserListTable.tsx": "Displays a table of user approval requests with status badges (pending/approved/rejected) and allows admins to approve pending users via mutation hook and toast notifications.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Renders a clickable card for a blog post showing title, published date, excerpt, and a 'Read more' link to the full post.",
  "frontend/src/components/home/DailyTaskSection.tsx": "Provides a daily task interface that opens random external links for users to find secret codes, then allows submission of those codes via a form with success feedback.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with responsive background images, Bengali welcome text about online earning, and a CTA button linking to the registration page.",
  "frontend/src/components/home/TimeBucksMegaEarningTaskCard.tsx": "Promotional card for TimeBucks affiliate link highlighting earning opportunities ($2-$5 daily) with a $1 signup bonus and external link button.",
  "frontend/src/components/home/TimeBucksStepByStepGuideSection.tsx": "Step-by-step guide section explaining how to sign up, verify, and earn money on TimeBucks with numbered steps and special notes.",
  "frontend/src/components/home/TranscribeMeSectionCard.tsx": "Promotional card for TranscribeMe transcription work with step-by-step registration guide, payment info, and external link to job application.",
  "frontend/src/components/home/WelcomeSection.tsx": "Welcome section with Bengali text introducing the site owner (Md. Habibur Rahman) and describing the platform's purpose for teaching online earning methods.",
  "frontend/src/components/layout/MobileMenu.tsx": "A mobile navigation menu component that slides in from the right, locks body scroll when open, handles escape key to close, and displays navigation links including a dropdown for work tasks.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component displaying copyright info, owner details (Md. Habibur Rahman), WhatsApp contact link, quick navigation links, and a Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header component with logo, desktop navigation menu with work tasks dropdown, mobile menu toggle, and a \"Get Started\" CTA button that adapts between mobile and desktop layouts.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout wrapper that renders a fixed background with overlay, then positions the header, main content outlet, and footer in a flex column structure.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "A placeholder component for advertisement spaces with three variants (banner, sidebar, in-content) displaying a dashed border box with an icon and label.",
  "frontend/src/components/monetization/AdsterraNativeBanner.tsx": "Component that dynamically loads and renders an Adsterra native banner ad script, preventing duplicate script injection and cleaning up on unmount.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "A placeholder card component for affiliate product recommendations with customizable title, description, and a \"Learn More\" button.",
  "frontend/src/components/registration/LoginForm.tsx": "Empty file placeholder for login form component.",
  "frontend/src/components/registration/RegistrationForm.tsx": "Empty file placeholder for registration form component.",
  "frontend/src/components/seo/Seo.tsx": "SEO component that dynamically updates document title, meta tags (description, Open Graph, Twitter Card), canonical URL, and article-specific tags based on provided props.",
  "frontend/src/components/tasks/ApprovalGuard.tsx": "Authentication guard component that redirects unauthenticated users to registration and displays blocking messages for pending or rejected user accounts, only allowing approved users to access child content.",
  "frontend/src/components/tasks/TaskHowToCompleteSection.tsx": "Informational component displaying a numbered 4-step guide on how to complete a task, including starting work, finding the secret code, pasting it, and submitting.",
  "frontend/src/components/tasks/TaskInteractionCard.tsx": "React component that displays a card with a button to open a task URL in a new tab and a form to submit a secret code, showing a success message on submission.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous actor for backend communication, initializing access control with an admin token from URL parameters and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAuthContext.tsx": "Empty file with no content.",
  "frontend/src/hooks/useBlogPosts.ts": "Custom React hooks for fetching blog posts (all posts, single post by slug, and search) from the backend actor, with fallback to sample posts on error or when actor is unavailable.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for idle handling and identity provider.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user management operations including registration, login, fetching all users, managing approvals, and approving users with proper error handling and query invalidation.",
  "frontend/src/index.css": "Global CSS with Tailwind directives, custom CSS variables for light/dark themes with neon color palette, fixed parallax background images (desktop/mobile), and site overlay styling.",
  "frontend/src/lib/blogSampleFallback.ts": "Exports sample blog posts array used as fallback content when backend is unavailable, including posts about passive income strategies and digital marketing.",
  "frontend/src/lib/helpLinks.ts": "Exports an array of help links with labels and Facebook profile URLs for two admins.",
  "frontend/src/lib/registrationConfig.ts": "Configuration object containing the Google Form embed URL for the registration page.",
  "frontend/src/lib/siteConfig.ts": "Site-wide configuration object for SEO metadata including site name, description, URL, and default image for the H★S Online Earn Platform.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient, InternetIdentityProvider, and App component wrapped in their respective providers.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying biography, expertise, interests, and contact information with social media links and ad placeholders.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with hardcoded login authentication (username: 'admin', password: 'habibur123') that manages user approval status and displays user lists with filtering capabilities.",
  "frontend/src/pages/BlogListPage.tsx": "Blog listing page that fetches and displays all blog posts in a grid layout with loading and error states, plus ad placeholders.",
  "frontend/src/pages/BlogPostPage.tsx": "Individual blog post page that displays full post content with metadata, formatted date, ad placements, and affiliate link placeholders based on slug parameter.",
  "frontend/src/pages/HomePage.tsx": "Home page component that renders HeroSection and WelcomeSection components with SEO metadata.",
  "frontend/src/pages/PaymentProofPage.tsx": "Payment proof gallery page displaying four payment proof images in a grid with Bengali text and an external link to upload new proofs via Google Forms.",
  "frontend/src/pages/RegistrationPage.tsx": "Registration and login page with tabbed interface that redirects authenticated users to home and displays registration/login forms with Bengali hero section.",
  "frontend/src/pages/SupportPage.tsx": "Displays a support/contact page with two administrator cards (Habibur Rahman and Sumaiya/Sumi), each containing a Facebook contact button linking to their profiles.",
  "frontend/src/pages/Task1Page.tsx": "Renders Task 1 page with SEO, approval guard, task instructions, interaction card for URL 'https://shrinkme.click/1BpQ6Y', and a back-to-home link.",
  "frontend/src/pages/Task2Page.tsx": "Renders Task 2 page with SEO, approval guard, task instructions, interaction card for URL 'https://shrinkme.click/2CqR7Z', and a back-to-home link.",
  "frontend/src/pages/Task3Page.tsx": "Renders Task 3 page with SEO, approval guard, task instructions, interaction card for URL 'https://shrinkme.click/3DsT8A', and a back-to-home link.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (neon, rainbow, sidebar), container settings, border radius variables, and custom box shadows including neon effects.",
  "project_state.json": "Project state document tracking architectural decisions, known issues (Internet Identity blocking admin access), existing features, and requirements for consolidating authentication logic into App.tsx."
}