{
  "backend/main.mo": "Motoko backend defining BlogPost type with create, get, list, and search functions using an in-memory Map.",
  "feature_evidence.json": "Feature evidence report listing SEO, indexing, and branding changes with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base and theme variable definitions including light and dark mode OKLCH color tokens.",
  "frontend/index.html": "HTML entry file setting global SEO title, description, robots meta tag, and mounting the React app.",
  "frontend/public/robots.txt": "Robots.txt allowing full indexing and referencing the sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing main pages, task pages, and sample blog post URLs.",
  "frontend/scripts/README-sitemap.md": "Instructions for updating sitemap.xml when blog posts change.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, blog, post detail, about, and task pages within SiteLayout.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Displays a blog post preview card with title, date, excerpt, and link to full post.",
  "frontend/src/components/home/DailyTaskSection.tsx": "Daily task UI that opens random external links and accepts a user-submitted secret code with success feedback.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with background image, English headline, Bengali intro text, and a CTA linking to Facebook.",
  "frontend/src/components/home/TimeBucksMegaEarningTaskCard.tsx": "Displays a promotional card for TimeBucks with earning details and a CTA button opening an external signup link.",
  "frontend/src/components/home/TimeBucksStepByStepGuideSection.tsx": "Shows a step-by-step guide for using TimeBucks along with a special reminder note.",
  "frontend/src/components/home/TranscribeMeSectionCard.tsx": "Presents a detailed card explaining TranscribeMe transcription work, steps, tips, and a link to apply.",
  "frontend/src/components/home/WelcomeSection.tsx": "Introduces the site owner and explains upcoming income-site content for users.",
  "frontend/src/components/layout/MobileMenu.tsx": "Implements a slide-out mobile navigation menu with scroll locking and various links.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with about info, quick links, help links, social icons, and copyright.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides the site header with logo, navigation links, a tasks dropdown, and mobile menu trigger.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the overall page layout with background, header, outlet content, and footer.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "Displays a styled placeholder box for ads with different size variants.",
  "frontend/src/components/monetization/AdsterraNativeBanner.tsx": "Loads an Adsterra script once and renders a container div for the native banner.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "Displays a styled affiliate link placeholder with title, description, and a button.",
  "frontend/src/components/seo/Seo.tsx": "Updates document title, meta tags, Open Graph, Twitter Card, and canonical link for SEO.",
  "frontend/src/components/tasks/TaskHowToCompleteSection.tsx": "Shows a four‑step instructional list for completing a task.",
  "frontend/src/components/tasks/TaskInteractionCard.tsx": "Provides UI to start a task, enter a secret code, and show a temporary success message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useBlogPosts.ts": "Fetches blog posts, single posts, and search results using the actor with fallback to sample posts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and state management.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for theming, backgrounds, and global layout.",
  "frontend/src/lib/blogSampleFallback.ts": "Provides fallback sample blog posts when the backend has no data or is unavailable.",
  "frontend/src/lib/helpLinks.ts": "Exports a list of admin help links with labels and Facebook URLs.",
  "frontend/src/lib/siteConfig.ts": "Defines global site metadata including name, description, URL, and default image.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with biography, expertise sections, and contact information.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a list of blog posts with loading, error, and empty states.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a single blog post with metadata, ads, and fallback handling for missing posts.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with SEO metadata, hero section, and welcome section.",
  "frontend/src/pages/Task1Page.tsx": "Displays Task 1 instructions and interaction card with a link to the task URL.",
  "frontend/src/pages/Task2Page.tsx": "Displays Task 2 instructions and interaction card with a link to the task URL.",
  "frontend/src/pages/Task3Page.tsx": "Displays Task 3 instructions and interaction card with a link to the task URL.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, themes, plugins, and container settings.",
  "project_state.json": "Tracks project version, homepage/visual/navigation design requirements, known issues, and existing feature definitions for the site."
}