{
  "backend/main.mo": "Motoko actor managing blog posts with create, fetch, list, search, and slug retrieval, storing posts in a Map and sorting by published date.",
  "feature_evidence.json": "Feature evidence report linking a Google Form embed requirement to specific frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing high-level summaries of various frontend files for reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light/dark themes and applying global background and text rules.",
  "frontend/index.html": "Base HTML file defining metadata and mounting the React app via main.tsx.",
  "frontend/public/registration.html": "Static HTML entrypoint for the registration page loading the React app.",
  "frontend/public/registration/index.html": "Alternate static HTML entrypoint for the registration route loading the React app.",
  "frontend/public/robots.txt": "Robots file allowing all crawlers and pointing to sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing all main pages and sample blog posts with priorities and change frequency.",
  "frontend/scripts/README-sitemap.md": "Instructions for updating sitemap.xml when adding or modifying blog posts.",
  "frontend/src/App.tsx": "Main router configuration defining all site routes including registration, tasks, blog, and static pages.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Blog post preview card showing title, date, excerpt, and link to full post.",
  "frontend/src/components/home/DailyTaskSection.tsx": "Daily task component opening random task links and accepting a secret code submission with success feedback.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with background image, Bengali intro text, and a CTA button linking to registration.",
  "frontend/src/components/home/TimeBucksMegaEarningTaskCard.tsx": "Displays a promotional TimeBucks earning card with bonus info and a signup button opening an external link.",
  "frontend/src/components/home/TimeBucksStepByStepGuideSection.tsx": "Shows a step‑by‑step guide for earning with TimeBucks, including steps, tips, and a special note.",
  "frontend/src/components/home/TranscribeMeSectionCard.tsx": "Presents a TranscribeMe job overview with instructions, requirements, tips, and a CTA linking to the signup page.",
  "frontend/src/components/home/WelcomeSection.tsx": "Renders a welcome message from the site owner describing upcoming income resources.",
  "frontend/src/components/layout/MobileMenu.tsx": "Implements a slide‑in mobile navigation menu with links, scroll lock, and escape‑to‑close handling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays the footer with copyright, social link, quick navigation links, and a caffeine.ai attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides the main site header with logo, navigation links, a tasks dropdown, and mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the full page layout including background, header, routed content, and footer.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "Renders a styled placeholder box for ad spaces in various size variants.",
  "frontend/src/components/monetization/AdsterraNativeBanner.tsx": "Loads and cleans up an Adsterra script once and renders a container div for the native banner.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "Displays a styled placeholder card for affiliate links with title, description, and button.",
  "frontend/src/components/seo/Seo.tsx": "Sets document title and updates SEO, Open Graph, Twitter, and canonical meta tags dynamically.",
  "frontend/src/components/tasks/TaskHowToCompleteSection.tsx": "Shows a static four‑step guide explaining how to complete a task.",
  "frontend/src/components/tasks/TaskInteractionCard.tsx": "Provides a start‑work button and form to submit a secret code with success feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates queries when it changes.",
  "frontend/src/hooks/useBlogPosts.ts": "Hooks for fetching, retrieving, and searching blog posts using the actor with fallbacks to sample data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication, login, and stored identities.",
  "frontend/src/index.css": "Tailwind base styles with extensive CSS variables and themed backgrounds for light and dark modes.",
  "frontend/src/lib/blogSampleFallback.ts": "Provides fallback sample blog posts when the backend has no data.",
  "frontend/src/lib/helpLinks.ts": "Exports a list of admin help links with labels and URLs.",
  "frontend/src/lib/registrationConfig.ts": "Holds configuration for the registration page, including an embeddable Google Form URL.",
  "frontend/src/lib/siteConfig.ts": "Defines global site metadata such as name, description, and default image.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with biography, expertise sections, contact info, and ads.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a list of blog posts with loading, error, and empty states along with ads.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a full blog post with metadata, content, ads, and navigation back to the blog list.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with SEO setup, hero section, and welcome content.",
  "frontend/src/pages/PaymentProofPage.tsx": "Displays payment proof images in a gallery with upload link and SEO metadata.",
  "frontend/src/pages/RegistrationPage.tsx": "Renders the registration page with hero section, embedded Google Form, and CTA button.",
  "frontend/src/pages/SupportPage.tsx": "Support page showing two admin contacts with Facebook links and SEO metadata.",
  "frontend/src/pages/Task1Page.tsx": "Task 1 page with SEO, task instructions, a task interaction card, and a back-to-home link.",
  "frontend/src/pages/Task2Page.tsx": "Task 2 page providing instructions, a task interaction card with its URL, and a back-to-home link.",
  "frontend/src/pages/Task3Page.tsx": "Task 3 page including instructions, a task interaction card, SEO config, and a back-to-home link.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, radius, shadows, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, required UI changes, architectural notes, known issues, and feature metadata for ongoing development."
}