{
  "backend/main.mo": "Main Motoko backend actor implementing user registration/login with approval workflow, blog post management, and role-based access control using AccessControl and UserApproval modules.",
  "feature_evidence.json": "Feature evidence report documenting two mobile-responsive UserListTable improvements: card-based stacked layout for screens <768px and dark-themed styling with proper touch targets.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration with details about SEO, styling, authentication, and blog functionality.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including sidebar, chart, and UI component colors.",
  "frontend/index.html": "Main HTML entry point with SEO meta tags for H★S Online Earn Platform, robots indexing directive, and root div for React mounting.",
  "frontend/public/registration.html": "Static HTML file for registration route with identical structure to index.html including SEO meta tags and React root mounting point.",
  "frontend/public/registration/index.html": "Nested registration route HTML file with same SEO configuration and React mounting structure as other entry points.",
  "frontend/public/robots.txt": "Search engine robots file allowing all crawlers to index the entire site and specifying sitemap location.",
  "frontend/public/sitemap.xml": "XML sitemap listing all site URLs including home, registration, blog pages, tasks, and individual blog posts with priority and change frequency metadata.",
  "frontend/scripts/README-sitemap.md": "Documentation explaining when and how to manually update the sitemap.xml file when adding, removing, or changing blog post URLs.",
  "frontend/src/App.tsx": "Main React application file defining AuthContext/Provider for session management, RegistrationForm and LoginForm components, and TanStack Router configuration for all application routes.",
  "frontend/src/components/admin/UserListTable.tsx": "Displays a table of user approval requests with status badges (pending, approved, rejected) and allows admins to approve pending users via mutation hook with toast notifications.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Renders a clickable card for a blog post showing title, published date, excerpt, and a 'Read more' link to the post detail page.",
  "frontend/src/components/home/DailyTaskSection.tsx": "Provides a daily task interface that opens random external links from a predefined list and allows users to submit secret codes found in those links with success feedback.",
  "frontend/src/components/home/HeroSection.tsx": "Displays the main hero section with responsive background images, a welcome headline in English, Bengali description text, and a CTA button linking to the registration page.",
  "frontend/src/components/home/TimeBucksMegaEarningTaskCard.tsx": "Promotional card for TimeBucks affiliate link highlighting earning opportunities ($2-$5 daily) with a $1 signup bonus and external link button.",
  "frontend/src/components/home/TimeBucksStepByStepGuideSection.tsx": "Displays a 5-step guide in Bengali explaining how to sign up, verify, complete profile, start tasks, and withdraw payments from TimeBucks.",
  "frontend/src/components/home/TranscribeMeSectionCard.tsx": "Promotional card for TranscribeMe transcription jobs with a 3-step guide in Bengali, highlighting $15-22/hour earning potential and PayPal payment method.",
  "frontend/src/components/home/WelcomeSection.tsx": "Displays a welcome message in Bengali from Md. Habibur Rahman introducing the website's purpose to provide free income site tutorials and easy tasks.",
  "frontend/src/components/layout/MobileMenu.tsx": "Mobile slide-out navigation menu with backdrop, escape key handling, body scroll lock, and links to home, work tasks (Task 1-3), payment proof, and support pages.",
  "frontend/src/components/layout/SiteFooter.tsx": "Site footer displaying copyright, owner info (Md. Habibur Rahman), WhatsApp contact link, quick navigation links, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky site header with logo, desktop navigation (home, work tasks dropdown, payment proof, support), mobile menu toggle, and \"Get Started\" CTA button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout wrapper component with fixed parallax background, dark overlay, and renders SiteHeader, page content via Outlet, and SiteFooter.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "Placeholder component for advertisement spaces with three variants (banner, sidebar, in-content) showing dashed border boxes with \"Advertisement Space\" text.",
  "frontend/src/components/monetization/AdsterraNativeBanner.tsx": "Adsterra native banner ad component that dynamically loads the ad script and renders the ad container with cleanup on unmount.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "Placeholder card component for affiliate product recommendations with customizable title, description, and \"Learn More\" button.",
  "frontend/src/components/registration/LoginForm.tsx": "Empty file for login form component (not yet implemented).",
  "frontend/src/components/registration/RegistrationForm.tsx": "Empty file for registration form component (not yet implemented).",
  "frontend/src/components/seo/Seo.tsx": "SEO component that dynamically updates document title, meta tags (description, Open Graph, Twitter Card), canonical URL, and article-specific tags based on props.",
  "frontend/src/components/tasks/ApprovalGuard.tsx": "Route guard component that redirects unauthenticated users to registration and blocks pending/rejected users from accessing task pages with status-specific messages.",
  "frontend/src/components/tasks/TaskHowToCompleteSection.tsx": "Instructional section component displaying a numbered 4-step guide on how to complete tasks (start work, find code, paste code, submit).",
  "frontend/src/components/tasks/TaskInteractionCard.tsx": "React component that displays a card with a button to open a task URL in a new tab and a form to submit a secret code, showing a success message on submission.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous actor instance for backend communication, initializing access control with an admin token from URL parameters and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAuthContext.tsx": "Empty file with no content.",
  "frontend/src/hooks/useBlogPosts.ts": "Custom React hooks for fetching blog posts (all, single by slug, or search) from the backend actor, falling back to sample posts on error or when no actor is available.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user management (register, login, get all users, approvals) and mutations that interact with the backend actor and invalidate related queries on success.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for light/dark themes, neon color palette, fixed parallax background images (desktop/mobile), and various utility classes for glass effects and animations.",
  "frontend/src/lib/blogSampleFallback.ts": "Exports an array of sample BlogPost objects used as fallback content when the backend is unavailable, featuring articles about passive income and digital marketing.",
  "frontend/src/lib/helpLinks.ts": "Exports a constant array of help links with labels and Facebook profile URLs for two admins.",
  "frontend/src/lib/registrationConfig.ts": "Configuration object containing a Google Form embed URL for the registration page.",
  "frontend/src/lib/siteConfig.ts": "Site-wide configuration object for SEO metadata including site name, description, URL, and default image for the H★S Online Earn Platform.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider and InternetIdentityProvider wrapping the main App component.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying biography, expertise areas, contact information, and social media links with ad placeholders and SEO metadata.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with hardcoded authentication (username: 'admin', password: 'habibur123') that manages user approvals and displays user status information.",
  "frontend/src/pages/BlogListPage.tsx": "Blog listing page that fetches and displays all blog posts in a grid layout with loading states, error handling, and ad placements.",
  "frontend/src/pages/BlogPostPage.tsx": "Individual blog post page that displays full post content with metadata, formatted dates, ad placements, and affiliate link placeholders based on URL slug parameter.",
  "frontend/src/pages/HomePage.tsx": "Home page component that renders HeroSection and WelcomeSection components with SEO metadata.",
  "frontend/src/pages/PaymentProofPage.tsx": "Payment proof gallery page displaying four proof images in a grid with an external link button to upload new proofs via Google Forms.",
  "frontend/src/pages/RegistrationPage.tsx": "Registration and login page with tabbed interface, authentication state management, automatic redirect for authenticated users, and Bengali language hero section.",
  "frontend/src/pages/SupportPage.tsx": "Support contact page displaying two administrator cards (Habibur Rahman and Sumaiya/Sumi) with Facebook profile links and contact buttons, using glass-morphism styled cards with SEO metadata.",
  "frontend/src/pages/Task1Page.tsx": "Task 1 page component that renders task instructions, an interaction card with a shrinkme.click URL, and a back-to-home button, wrapped in ApprovalGuard for access control.",
  "frontend/src/pages/Task2Page.tsx": "Task 2 page component identical in structure to Task1Page but with a different shrinkme.click URL, also wrapped in ApprovalGuard.",
  "frontend/src/pages/Task3Page.tsx": "Task 3 page component identical in structure to Task1Page and Task2Page but with its own unique shrinkme.click URL, wrapped in ApprovalGuard.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including neon and rainbow palettes using OKLCH color space), container settings, border radius variables, and custom box-shadow utilities for the application theme.",
  "project_state.json": "Project state metadata documenting architectural decisions, visual theme requirements (full-screen background, Bengali welcome text with rainbow animation, neon styling), navigation structure, and feature implementation history at version 79."
}