{
  "backend/main.mo": "Main Motoko actor implementing blog posts, user registration/login with password hashing, access control with admin permissions, and user approval workflow integrated with authorization mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including components, pages, hooks, configuration, and public assets.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "Main HTML entry point with SEO meta tags for H★S Online Earn Platform, robots indexing directive, and root div mounting the React application.",
  "frontend/public/registration.html": "Duplicate HTML entry point identical to index.html for the registration route with same meta tags and React mounting setup.",
  "frontend/public/registration/index.html": "Another duplicate HTML entry point identical to index.html for nested registration path with same meta tags and React mounting setup.",
  "frontend/public/robots.txt": "Robots.txt file allowing all search engines to index the entire site and specifying sitemap location at /sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing all site URLs including home, registration, blog, about, payment proof, support, task pages, and five blog post URLs with priorities and change frequencies.",
  "frontend/scripts/README-sitemap.md": "Documentation explaining when and how to update the sitemap.xml file when adding, removing, or changing blog post URLs.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes including home, blog, tasks, payment proof, support, registration, and admin panel with SiteLayout as root component.",
  "frontend/src/components/admin/UserListTable.tsx": "Admin component displaying registered users in a responsive table with approval status badges and approve/reject action buttons using React Query hooks for user and approval data.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Blog post card component with neon subheading styling, formatted date display, excerpt preview, and link to full post detail page.",
  "frontend/src/components/home/DailyTaskSection.tsx": "Displays a daily task section where users click a button to open a random shrinkme.click link, retrieve a secret code, and submit it via a form with success feedback.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with responsive background images, a bold English headline, Bengali subheadline describing the platform, and a CTA button linking to the registration page.",
  "frontend/src/components/home/TimeBucksMegaEarningTaskCard.tsx": "Promotional card for TimeBucks referral link highlighting earning opportunities ($2-$5/day) with a $1 signup bonus and external link button.",
  "frontend/src/components/home/TimeBucksStepByStepGuideSection.tsx": "Step-by-step guide section explaining how to sign up, verify, complete profile, work, and withdraw payments from TimeBucks, with numbered steps and special notes.",
  "frontend/src/components/home/TranscribeMeSectionCard.tsx": "Card promoting TranscribeMe audio transcription work with a step-by-step guide for registration, testing, and payment, plus a CTA button to their jobs page.",
  "frontend/src/components/home/WelcomeSection.tsx": "Welcome section with a Bengali greeting from Md. Habibur Rahman introducing the platform and promising to add income sites with free training.",
  "frontend/src/components/layout/MobileMenu.tsx": "Slide-in mobile menu component with backdrop, navigation links (Home, Work Tasks, Payment Proof, Support), escape key handling, and body scroll locking.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component with copyright info, WhatsApp contact button, quick navigation links, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Site header component with sticky navigation, logo, desktop menu with dropdown for work tasks, mobile menu toggle, and a 'Get Started' button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout wrapper that renders a fixed background with overlay, and includes SiteHeader, main content outlet, and SiteFooter.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "Placeholder component for advertisement spaces with configurable variants (banner, sidebar, in-content) and styling.",
  "frontend/src/components/monetization/AdsterraNativeBanner.tsx": "Component that dynamically loads and displays an Adsterra native banner ad script with cleanup on unmount.",
  "frontend/src/components/monetization/AffiliateLinkPlaceholder.tsx": "Placeholder card component for affiliate product recommendations with customizable title, description, and call-to-action button.",
  "frontend/src/components/registration/LoginForm.tsx": "Login form component with email/username and password fields, password visibility toggle, error handling, and integration with authentication hooks.",
  "frontend/src/components/registration/RegistrationForm.tsx": "Registration form with validation for username, WhatsApp number, group, email, and password fields, plus success dialog and error handling.",
  "frontend/src/components/seo/Seo.tsx": "SEO component that dynamically updates document title, meta tags (Open Graph, Twitter Card), and canonical URL based on page props.",
  "frontend/src/components/tasks/ApprovalGuard.tsx": "Guard component that checks user authentication and approval status, blocking unapproved users from accessing task content while allowing admins.",
  "frontend/src/components/tasks/TaskHowToCompleteSection.tsx": "Informational section displaying a numbered list of steps explaining how to complete a task (start work, find code, paste, submit).",
  "frontend/src/components/tasks/TaskInteractionCard.tsx": "React component that displays a card with a button to open a task URL in a new tab and a form to submit a secret code, showing a success message on submission.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, handling authentication with Internet Identity and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAuthContext.tsx": "React context provider and hook for managing user authentication state, persisting login sessions to localStorage with login/logout functionality.",
  "frontend/src/hooks/useBlogPosts.ts": "Custom hooks for fetching blog posts from the backend actor using React Query, with fallback to sample posts when the backend is unavailable or returns empty results.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login flow, identity state, and integration with DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user management operations including registration, login, approval status checks, and admin functions for managing users and approvals.",
  "frontend/src/index.css": "Global CSS file with Tailwind configuration, custom CSS variables for theming (including neon colors), and styles for fixed background images with responsive mobile support.",
  "frontend/src/lib/blogSampleFallback.ts": "Exports sample blog post data used as fallback content when the backend is unavailable, containing full articles about passive income and digital marketing.",
  "frontend/src/lib/helpLinks.ts": "Configuration file exporting an array of help links with labels and Facebook URLs for two admin contacts.",
  "frontend/src/lib/registrationConfig.ts": "Configuration object containing the Google Form embed URL for the registration page.",
  "frontend/src/lib/siteConfig.ts": "Exports site-wide configuration object containing name, description, URL, and default image for SEO and metadata purposes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About Me page with biography, expertise sections, contact information, and social media links, including ad placeholders.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin-only page that checks caller permissions and displays UserListTable for managing users, or shows access denied message for non-admins.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a grid of blog post cards fetched via useGetPosts hook, with loading states, error handling, and ad placements.",
  "frontend/src/pages/BlogPostPage.tsx": "Renders individual blog post content by slug parameter, including formatted date, article content, and affiliate/ad placements.",
  "frontend/src/pages/HomePage.tsx": "Simple home page component that renders HeroSection and WelcomeSection with SEO metadata.",
  "frontend/src/pages/PaymentProofPage.tsx": "Displays a gallery of payment proof images with an external link button to upload new proofs via Google Forms.",
  "frontend/src/pages/RegistrationPage.tsx": "Tabbed page with registration and login forms, showing success state for authenticated users with redirect to tasks.",
  "frontend/src/pages/SupportPage.tsx": "Contact support page displaying two administrator cards with Facebook contact buttons for Habibur Rahman and Sumaiya.",
  "frontend/src/pages/Task1Page.tsx": "Task 1 page component that renders SEO metadata, an approval guard, task instructions, a task interaction card with a shrinkme.click URL, and a back-to-home navigation link.",
  "frontend/src/pages/Task2Page.tsx": "Task 2 page component identical in structure to Task1Page but with a different shrinkme.click URL for the task interaction card.",
  "frontend/src/pages/Task3Page.tsx": "Task 3 page component identical in structure to Task1Page but with a different shrinkme.click URL for the task interaction card.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract, persist, and clear URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (using OKLCH), container settings, border radius variables, neon/rainbow color palettes, and custom box-shadow utilities for the design system.",
  "project_state.json": "Project state document tracking architectural decisions, known issues (mobile menu, contrast, deployment errors, AuthProvider missing), and feature history for a Bengali blog site with task management and registration functionality."
}