{
  "kind": "build_request",
  "title": "Fix AuthProvider wrapper to resolve useAuth context error",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-119",
      "text": "Update frontend/src/main.tsx to wrap the App component with the AuthProvider from frontend/src/hooks/useAuthContext.tsx, ensuring the AuthProvider wraps the RouterProvider and QueryClientProvider so the authentication context is available globally to all routes and components, including the Registration and Login pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "I am getting an error: 'useAuth must be used within an AuthProvider'. Please wrap the main App component or the Router with the AuthProvider in App.tsx or index.tsx. Ensure that the authentication context is available globally so the registration and login pages can work correctly."
        ]
      },
      "acceptanceCriteria": [
        "The AuthProvider from frontend/src/hooks/useAuthContext.tsx wraps the entire app at the root level in frontend/src/main.tsx",
        "The component hierarchy ensures AuthProvider wraps both QueryClientProvider and RouterProvider",
        "The 'useAuth must be used within an AuthProvider' error no longer occurs",
        "Registration and Login pages can successfully access the authentication context via the useAuth hook",
        "The authentication state persists across navigation and page refreshes"
      ]
    }
  ],
  "constraints": [
    "Do not modify frontend/src/hooks/useInternetIdentity.tsx or frontend/src/hooks/useActor.ts",
    "Preserve the existing QueryClient and InternetIdentityProvider wrapper structure",
    "Ensure the AuthProvider is positioned correctly in the provider hierarchy so useAuth hook works in all child components"
  ],
  "nonGoals": [
    "Modifying the AuthProvider implementation itself",
    "Changing the authentication logic or user flow",
    "Adding new authentication features"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}