{
  "kind": "build_request",
  "title": "Make Admin Panel table mobile-responsive with stacked layout",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-161",
      "text": "Update the UserListTable component (frontend/src/components/admin/UserListTable.tsx) to implement a mobile-responsive stacked layout where each user is displayed as a card instead of a table row on small screens (< 768px), with the user's information (Username, WhatsApp Number, Status badge) stacked vertically and the 'Approve' button positioned directly below the status badge within each card.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "The 'Approve' button is cut off on my mobile screen. Please update the Admin Panel table to be stacked for mobile view. Put the 'Approve' button directly below each user's status so I don't have to scroll right."
        ]
      },
      "acceptanceCriteria": [
        "On mobile screens (< 768px), the user list displays as vertically stacked cards instead of a horizontal table",
        "Each user card shows Username, WhatsApp Number, and Status badge stacked vertically",
        "The 'Approve' button appears directly below the status badge within each card",
        "No horizontal scrolling is required on mobile devices",
        "The 'Approve' button is fully visible and easily tappable on mobile screens",
        "On desktop/tablet screens (≥ 768px), the table layout remains unchanged with the current side-by-side structure"
      ]
    },
    {
      "id": "REQ-162",
      "text": "Style the mobile card layout in UserListTable with proper spacing, borders, and background colors consistent with the site's dark theme and premium styling, ensuring each card is visually distinct and the 'Approve' button has adequate touch target size (minimum 44x44px) for mobile usability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ]
      },
      "acceptanceCriteria": [
        "Each user card on mobile has a semi-transparent dark background with rounded corners",
        "Cards have proper spacing between them (margin/padding)",
        "The 'Approve' button has a minimum touch target size of 44x44px",
        "Text is clearly readable with sufficient contrast against the dark background",
        "Status badges maintain their current color-coded styling (pending/approved/rejected)",
        "The mobile layout looks professional and consistent with the site's existing neon/premium theme"
      ]
    }
  ],
  "constraints": [
    "Do not change the desktop table layout or existing UserListTable functionality",
    "Preserve all existing status badge styling and color schemes",
    "Maintain the current approve user mutation logic and query invalidation behavior",
    "Use responsive Tailwind CSS utilities for breakpoint-based layout switching"
  ],
  "nonGoals": [
    "Changing the admin authentication system",
    "Modifying the backend getAllUsers or approveUser functions",
    "Adding new user management features beyond mobile layout improvement",
    "Changing the AdminPanelPage component structure or authentication flow"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}