{
  "kind": "build_request",
  "title": "Embed Google Form on Registration page and ensure /registration is live",
  "projectName": "H★S Online Earn Platform",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-98",
      "text": "Configure the Registration page to embed the user-provided Google Form link https://forms.gle/HFbiXDq74sSw1tPg6 so the form renders directly on the /registration page (inside the existing iframe area) and users can fill it out on-site.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I have my Google Form ready. Please embed this link: https://forms.gle/HFbiXDq74sSw1tPg6 into the registration page so users can see and fill out the form directly on the website."
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/lib/registrationConfig.ts is updated so registrationConfig.googleFormEmbedUrl is set to use the provided form (https://forms.gle/HFbiXDq74sSw1tPg6) in a way that works in an iframe (i.e., the embedded form loads successfully on the page).",
        "Visiting /registration shows the embedded form (not the placeholder state).",
        "The embedded form is usable (scrollable if needed) on both mobile and desktop viewports."
      ]
    },
    {
      "id": "REQ-99",
      "text": "Ensure the Registration page is live and accessible in production at the stable route /registration, including direct navigation and browser refresh without a 404.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Also, make the page live."
        ]
      },
      "acceptanceCriteria": [
        "The TanStack Router route for /registration remains registered in frontend/src/App.tsx.",
        "Directly loading /registration in the deployed site (including browser refresh) serves the SPA and renders the Registration page content.",
        "The existing SPA fallback entrypoints for /registration (frontend/public/registration.html and frontend/public/registration/index.html) continue to be present and correctly mount the app."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Preserve the single-actor backend architecture; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not change the Google Form questions/fields; only embed the form in the website.",
    "Do not add new authentication or user account features.",
    "Do not add any new backend persistence for registration submissions (submissions remain managed by Google Forms)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}