{
  "kind": "build_request",
  "title": "Update Home hero section welcome message for team members",
  "projectName": "MHS Habibur Blog",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-44",
      "text": "Update the Home page hero section copy in `frontend/src/components/home/HeroSection.tsx` by replacing the current heading and description text with the provided professional team-member welcome message, and ensure the text is styled with a clean, modern font and uses white or light-yellow coloring to remain clearly visible against the dark background while maintaining a professional agency landing-page look.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-8",
          "msg-9"
        ],
        "quotes": [
          "Please update the main hero section of my blog 'MHS Habibur Blog'. Replace the current text with a professional welcome message for my team members. The message should state: 'Assalamu Alaikum, I am Md. Habibur Rahman. I amworking on professional typing projects in international marketplaces and building a skilled working team here. You can join my team, learn simple typing tasks in 10-15 minutes, and start earning with us.' Use a clean, modern font. The text should be white or light yellow to be clearly visible against the dark background. Make it look like a professional agency landing page.",
          "Yes, proceed"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/home/HeroSection.tsx` no longer displays the old heading (“Welcome to My Blog”) or the old description paragraph.",
        "The hero section displays the exact message text (verbatim, including punctuation and the \"10-15 minutes\" range): \"Assalamu Alaikum, I am Md. Habibur Rahman. I am working on professional typing projects in international marketplaces and building a skilled working team here. You can join my team, learn simple typing tasks in 10-15 minutes, and start earning with us.\"",
        "The hero message text is rendered in a clean, modern font style and appears in white or light-yellow (or a white-to-light-yellow treatment) with sufficient contrast against the existing dark/overlay hero background.",
        "The updated hero section looks consistent with the site’s existing professional/neon theme and remains responsive on mobile and desktop without overlapping or truncation."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in `frontend/src/components/ui` or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep changes scoped to updating the hero section messaging and its styling; do not alter routes, ad components, or other home page sections."
  ],
  "nonGoals": [
    "Do not change the existing Home page section order or remove any existing sections (Welcome, Daily Task, TimeBucks, guide, TranscribeMe, ads, or blog CTA).",
    "Do not add new authentication, backend endpoints, or new pages as part of this change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}