{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update \"Join My Team\" CTA destinations to Facebook profile URL",
  "requirements": [
    {
      "id": "REQ-63",
      "summary": "Update Home page Hero section \"Join My Team ★\" CTA to navigate to the provided Facebook profile URL (external link) without changing its label or styling.",
      "acceptanceCriteria": [
        "On the Home page, clicking the Hero section \"Join My Team\" button navigates to https://www.facebook.com/share/1CPKURCrY8/.",
        "The button label remains \"Join My Team ★\" (no user-facing text changes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/home/HeroSection.tsx",
          "operation": "modify",
          "description": "Replace the current internal router Link destination (currently /tasks/task-1) with an external navigation to https://www.facebook.com/share/1CPKURCrY8/ while preserving the existing button label (\"Join My Team ★\") and all existing classes/styling. Ensure only this CTA destination changes and no other task links are affected."
        }
      ]
    },
    {
      "id": "REQ-64",
      "summary": "Update the Mobile Menu \"Join Team\" item to navigate to the provided Facebook profile URL while keeping the rest of the mobile menu structure/labels unchanged.",
      "acceptanceCriteria": [
        "In the mobile hamburger menu, clicking \"Join Team\" navigates to https://www.facebook.com/share/1CPKURCrY8/.",
        "The rest of the mobile menu structure and labels remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/MobileMenu.tsx",
          "operation": "modify",
          "description": "Change the \"Join Team\" menu item from an internal router Link (currently /tasks/task-1) to an external link that navigates to https://www.facebook.com/share/1CPKURCrY8/. Keep existing onClose behavior, styling classes, and all other menu items/labels unchanged; do not alter any other navigation destinations (Task 1/2/3, etc.)."
        }
      ]
    }
  ]
}