{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Internet Identity from Admin Panel and restore username/password login",
  "requirements": [
    {
      "id": "REQ-169",
      "summary": "Remove all Internet Identity authentication logic from the Admin Panel page",
      "acceptanceCriteria": [
        "No Internet Identity imports or hooks remain in AdminPanelPage.tsx",
        "No Internet Identity login UI or prompts are displayed on the admin panel page",
        "Admin panel does not attempt to authenticate using Internet Identity"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Remove all Internet Identity imports (useInternetIdentity hook), remove Internet Identity authentication checks, remove admin role verification calls (isCallerAdmin), and remove all code that depends on Internet Identity authentication state. Strip out the loading and access control logic tied to Internet Identity."
        }
      ]
    },
    {
      "id": "REQ-170",
      "summary": "Implement a simple username and password login form on the Admin Panel page",
      "acceptanceCriteria": [
        "Login form displays two clearly labeled text input fields: Username and Password",
        "Password field uses type='password' to mask input",
        "Submit button is clearly visible and labeled 'Login'",
        "Form styling matches site's dark theme with neon accents"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Add a login form component directly in AdminPanelPage.tsx with two input fields labeled 'Username' and 'Password', a submit button labeled 'Login', and form styling using the existing dark theme with neon accent colors from the site's Tailwind configuration. Ensure the password field uses type='password' to mask input."
        }
      ]
    },
    {
      "id": "REQ-171",
      "summary": "Implement admin authentication logic with hardcoded credentials in the Admin Panel page",
      "acceptanceCriteria": [
        "Login succeeds when username='admin' and password='habibur123'",
        "Login fails with error message for any other credentials",
        "Authenticated state is stored in sessionStorage",
        "User management interface is hidden until login succeeds",
        "Session persists across page navigation within the same browser session"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Add form submission handler that verifies username === 'admin' and password === 'habibur123', stores authenticated state in sessionStorage with key 'adminAuthenticated', displays error message for invalid credentials, conditionally renders the user management interface only when authenticated, and checks sessionStorage on component mount to restore session state."
        }
      ]
    },
    {
      "id": "REQ-172",
      "summary": "Update the getAllUsers query hook to work without Internet Identity authentication",
      "acceptanceCriteria": [
        "getAllUsers query does not require Internet Identity authentication",
        "Query successfully calls backend getAllUsers method",
        "Response data is properly parsed and returned to components",
        "Error messages include full error details for debugging"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useGetAllUsers hook to remove any Internet Identity authentication dependencies, ensure it calls the backend getAllUsers method using the actor from useActor without additional authentication checks, properly handle and parse the response data, and include comprehensive error handling that displays the full error message and stack trace for debugging purposes."
        }
      ]
    },
    {
      "id": "REQ-173",
      "summary": "Update AdminPanelPage to fetch users after login and display results with proper loading and error states",
      "acceptanceCriteria": [
        "getAllUsers query is triggered immediately after successful login",
        "Loading spinner or message displays while fetching user data",
        "Error messages are clearly displayed if fetch fails",
        "UserListTable renders with fetched user data on success",
        "Approve button is visible for each pending user in the table"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Wire the useGetAllUsers hook to trigger immediately after successful admin login (when authenticated state becomes true), display a loading spinner or text message while the query is fetching, show a clear error message with full error details if the fetch fails, and render the UserListTable component with the fetched user data when successful. Ensure the entire flow works with the simple username/password authentication without Internet Identity."
        }
      ]
    },
    {
      "id": "REQ-174",
      "summary": "Verify and wire UserListTable approve functionality without Internet Identity",
      "acceptanceCriteria": [
        "Approve button is visible next to each pending user",
        "Button click calls approveUser without Internet Identity authentication",
        "User list refreshes automatically after successful approval",
        "Success message displays after approval",
        "Approve button is properly sized for mobile (minimum 44x44px touch target)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/UserListTable.tsx",
          "operation": "modify",
          "description": "Verify that the Approve button is visible next to each user with status='Pending', ensure the button click handler calls the approveUser mutation without requiring Internet Identity authentication, automatically refresh the user list after successful approval by invalidating the getAllUsers query, display a success toast message after approval, and ensure the approve button has a minimum touch target size of 44x44px for mobile usability."
        }
      ]
    },
    {
      "id": "REQ-175",
      "summary": "Remove or disable Internet Identity authentication initialization from useActor hook",
      "acceptanceCriteria": [
        "Backend actor can be initialized without Internet Identity",
        "Admin panel operations work without Internet Identity authentication",
        "No Internet Identity login prompts appear for admin operations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Remove or comment out the Internet Identity authentication initialization logic that creates an authenticated actor, ensure the backend actor can be created and used in anonymous mode for admin panel operations, and verify that no Internet Identity login prompts are triggered when the actor is initialized or used by the admin panel."
        }
      ]
    }
  ]
}