{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make Admin Panel table mobile-responsive with stacked layout",
  "requirements": [
    {
      "id": "REQ-161",
      "summary": "Implement mobile-responsive stacked card layout in UserListTable component with breakpoint-based layout switching at 768px, displaying Username, WhatsApp Number, and Status badge vertically with the Approve button positioned directly below the status badge",
      "acceptanceCriteria": [
        "On mobile screens (< 768px), the user list displays as vertically stacked cards instead of a horizontal table",
        "Each user card shows Username, WhatsApp Number, and Status badge stacked vertically",
        "The 'Approve' button appears directly below the status badge within each card",
        "No horizontal scrolling is required on mobile devices",
        "The 'Approve' button is fully visible and easily tappable on mobile screens",
        "On desktop/tablet screens (≥ 768px), the table layout remains unchanged with the current side-by-side structure"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/UserListTable.tsx",
          "operation": "modify",
          "description": "Add responsive breakpoint logic using Tailwind's 'md:' prefix to toggle between mobile card layout (< 768px) and desktop table layout (≥ 768px). Wrap the existing table structure in a 'hidden md:table' container. Create a new mobile-only card layout (visible on < 768px, hidden on ≥ 768px) that iterates through users and displays each as a card with Username, WhatsApp Number, Status badge, and Approve button stacked vertically within each card container. Ensure the Approve button is positioned directly below the status badge in the card layout. Preserve all existing query logic, mutation behavior, and status badge rendering."
        }
      ]
    },
    {
      "id": "REQ-162",
      "summary": "Style mobile card layout with dark theme consistent styling including semi-transparent backgrounds, proper spacing, rounded corners, sufficient touch target size (minimum 44x44px) for the Approve button, and maintain existing status badge color schemes",
      "acceptanceCriteria": [
        "Each user card on mobile has a semi-transparent dark background with rounded corners",
        "Cards have proper spacing between them (margin/padding)",
        "The 'Approve' button has a minimum touch target size of 44x44px",
        "Text is clearly readable with sufficient contrast against the dark background",
        "Status badges maintain their current color-coded styling (pending/approved/rejected)",
        "The mobile layout looks professional and consistent with the site's existing neon/premium theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/UserListTable.tsx",
          "operation": "modify",
          "description": "Apply Tailwind CSS classes to the mobile card layout: use 'bg-black/40' or 'bg-gray-900/60' for semi-transparent dark backgrounds, 'rounded-lg' or 'rounded-xl' for rounded corners, 'space-y-4' for vertical spacing between cards, and 'p-4' or 'p-6' for internal card padding. Ensure the Approve button has 'min-h-[44px] min-w-[44px]' classes to meet the 44x44px touch target requirement. Apply text contrast classes ('text-white', 'text-gray-100', or similar) for readability. Verify that existing status badge classes (pending/approved/rejected color variants) are preserved and remain visible against the dark card background. Use consistent neon accent colors from the site's theme (referencing frontend/tailwind.config.js color schemes) for interactive elements."
        }
      ]
    }
  ]
}