{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Embed Google Form on Registration page and keep /registration route live",
  "requirements": [
    {
      "id": "REQ-98",
      "summary": "Embed the provided Google Form on the /registration page iframe area and make it usable on mobile/desktop.",
      "acceptanceCriteria": [
        "frontend/src/lib/registrationConfig.ts is updated so registrationConfig.googleFormEmbedUrl is set to use the provided form (https://forms.gle/HFbiXDq74sSw1tPg6) in a way that works in an iframe (i.e., the embedded form loads successfully on the page).",
        "Visiting /registration shows the embedded form (not the placeholder state).",
        "The embedded form is usable (scrollable if needed) on both mobile and desktop viewports."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/registrationConfig.ts",
          "operation": "modify",
          "description": "Set registrationConfig.googleFormEmbedUrl to the user-provided Google Form link (https://forms.gle/HFbiXDq74sSw1tPg6) using an iframe-compatible embed form (e.g., ensure the configured URL is an embeddable Google Forms URL or includes the needed embedded rendering parameters)."
        },
        {
          "path": "frontend/src/pages/RegistrationPage.tsx",
          "operation": "modify",
          "description": "Update the embedded iframe rendering to reliably load the configured embed URL and improve usability across viewports (responsive sizing/min-height and scroll behavior as needed) while keeping the embed inside the existing iframe area. Use existing shadcn-ui components already on the page (Button, Card) as-is for layout consistency; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-99",
      "summary": "Keep /registration registered in the SPA router and ensure static SPA fallbacks exist for direct loads/refresh without 404.",
      "acceptanceCriteria": [
        "The TanStack Router route for /registration remains registered in frontend/src/App.tsx.",
        "Directly loading /registration in the deployed site (including browser refresh) serves the SPA and renders the Registration page content.",
        "The existing SPA fallback entrypoints for /registration (frontend/public/registration.html and frontend/public/registration/index.html) continue to be present and correctly mount the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify /registration remains a stable TanStack Router route (registered in the route tree with path exactly '/registration') and keep it wired to RegistrationPage so in-app navigation renders correctly."
        },
        {
          "path": "frontend/public/registration.html",
          "operation": "modify",
          "description": "Ensure the /registration SPA fallback HTML continues to correctly mount the React app (root mount element present and main module script included) so direct navigation/refresh does not 404 in production."
        },
        {
          "path": "frontend/public/registration/index.html",
          "operation": "modify",
          "description": "Ensure the /registration/index.html SPA fallback HTML continues to correctly mount the React app (root mount element present and main module script included) to support deployments that serve index.html for nested paths."
        }
      ]
    }
  ]
}